content/notes/amplify_my_strenghts.md
+++
title = "amplify my strenghts"
author = ["Wanderson Ferreira"]
lastmod = 2022-05-09T08:43:00-03:00
draft = false
+++

The idea to amplify where you have a good advantage seems interesting but how to
pin point our strengths? I've been battling with this idea for quite some [time]({{< relref "time.md" >}})
now, my lastest career movement was solely driven by this quest.

In a recent interview process, I had a personality assessment stage where I
discussed with the Head of People all my previous work experiences. In the end
he said I'm an [intrapreneur]({{< relref "intrapreneurship.md" >}}) and I kind agree with that. It's very hard to have a
clear [understanding]({{< relref "understanding.md" >}}) and [guidance]({{< relref "guidance.md" >}}) towards the goal.

These are some of the advices I found online along the way:

> **Look at your work history, but be careful not to rule out a strength too
>  early**. Look at your <span class="underline">rate of improvement</span> compared to others with a similar
>  level of experience and training, rather than your absolute performance.

I have a genuine interest for the business behind the things I do as a
programmer. The idea of owning a product and being able to deliver it from start
to finish sounds very good to me. However, there are several roles that one
should take. Looking my career in retrospect there were things I really loved
about the journey and things I hated:

-   **understand the business**: loved it
-   **make decisions about business direction**: loved it
-   **hiring**: terrible because I'm not in charge of the offer
-   **technical decisions**: loved it
-   **technical trade-offs**: loved it (many bad calls, but I owned it. inevitable learning)
-   **providing technical mentorship**: loved it
-   **receiving technical mentorship**: loved it when available, terrible when you can't find
-   **people management**: hate it, specially delivering news I didn't personally agreed
-   **handling uncertainty**: loved it
-   **sales pitch**: loved it
-   **time pressure/crunch-mode**: loved it (when feasible and not 100% of time)
-   **creating solutions out of thin air**: loved it =))
-   **internal culture influencer**: loved it
-   **team work**: loved it, terrible when you can't get right team structure
-   **conflict management**: neutral
-   **compromising**: loved it (we can't win every battle)

Compare to others in similar position I was able to identity and active
contribute to each of the points above after starting in a completely new
project.

> \*What doesn't feel like work (but is)?

Programming / Problem solving.

> **What unusual combinations can you make?** One useful rule of thumb is to try to combine 2-3 strengths that are not commonly combined.

I usually get really involved in the business side of the technical things I
work on.


## Long list of skills {#long-list-of-skills}

I found an interesting [website](https://80000hours.org/articles/personal-strengths/) listing a very long list of skills based on
several categories which might be interesting to reference in the future.

However, these are ones I believe I have good fit:

-   **active learning**: [understanding]({{< relref "understanding.md" >}}) the implications of new information for problem solving and decision making
-   **critical thinking**: using logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions or approaches to problems
-   **coordination**: adjusting actions in relation to others' actions
-   **instructing**: teaching others how to do something
-   **social perceptiveness**: being aware of others' reactions and understanding why they react as they do
-   **complex problem solving skills**: identifying complex problems and reviewing related information to develop and evaluate options and implement solutions
-   **programming**: writing computer programs for various purposes
-   **technology design**: generating or adapting equipment and technology to serve user needs
-   **troubleshooting**: determining causes of operating errors and deciding what to do about it
-   **judgment and decision making**: considering the relative costs and benefits of potential actions to choose the most appropriate one
-   **systems analysis**: determining how a system should work and how changes in conditions, operations, and the environment will affect outcomes
-   **systems evaluation**: identifying measures or indicators of system performance and the actions needed to improve or correct performance, relatie to the goals of the system.


## Conclusion / Point of Actions {#conclusion-point-of-actions}

From the points given here, seems like [intrapreneurship]({{< relref "intrapreneurship.md" >}}) is really something I
should look more carefully! This raises some questions:

-   how to prepare myself to improve my chances in a new endeavor?
-   clearly the company I work for should foster/promote/reward this behavior. Am I currently in such place?
-   what are well known places where this is a good trait?
